Repository: FahimKhamsa/Drone-Sentinel-Mobile
Catalog: lib/l10n/app_*.arb
Languages: uk

# appTitle
source: Drone Detector
uk: Детектор Дронів

# supportBanner
source: Work in progress, click here for support
uk: Робота в процесі, натисніть тут для підтримки

# droneSentinelSubtitle
source: Advanced AI-Powered Drone Detection
uk: Розширене виявлення дронів на базі ШІ

source: Start Listening
uk: Почати прослуховування

source: Stop Listening
uk: Зупинити прослуховування

source: Loading...
uk: Завантаження...

# aboutTitle
source: About Drone Sentinel
uk: Про Drone Sentinel

# aboutDescription
source: Drone Sentinel uses advanced AI technology to detect drone sounds in real-time. Our machine learning model analyzes audio patterns to identify potential drone activity with high accuracy.
uk: Drone Sentinel використовує передові технології штучного інтелекту для виявлення звуків дронів у реальному часі. Наша модель машинного навчання аналізує звукові патерни для виявлення потенційної активності дронів з високою точністю.

source: Detection Dashboard
uk: Панель виявлення

source: Detection Threshold
uk: Поріг виявлення

source: DRONE DETECTED!
uk: ДРОН ВИЯВЛЕНО!

source: No Drone Detected
uk: Дрон не виявлено

source: Confidence
uk: Впевненість

source: Audio Waveform
uk: Звукова хвиля

source: Frequency Analysis
uk: Частотний аналіз

source: Prediction Scores
uk: Оцінки прогнозування

# errorTitle
source: Error
uk: Помилка

source: Initialization Error
uk: Помилка ініціалізації

source: Permission Denied
uk: Дозвіл відхилено

# microphonePermissionRequired
source: Microphone permission is required to use this app.
uk: Для використання цього додатку потрібен дозвіл на мікрофон.

# modelLoadError
source: Failed to load TensorFlow Lite model. Please check the model path and file.
uk: Не вдалося завантажити модель TensorFlow Lite. Будь ласка, перевірте шлях до моделі та файл.

source: OK
uk: ОК

source: Sound Detection Meter
uk: Лічильник виявлення звуку

source: Listening for sounds...
uk: Прослуховування звуків...

source: Listening...
uk: Прослуховування...

source: System Status
uk: Стан системи

source: Monitoring For
uk: Моніторинг

source: Background Noise, FPV Drone
uk: Фоновий шум, FPV дрон

source: Microphone
uk: Мікрофон

source: Connected
uk: Підключено

source: Model
uk: Модель

source: Loaded
uk: Завантажено

source: Detection Status
uk: Стан виявлення

source: Waiting for sounds...
uk: Очікування звуків...

source: Loading sound detection model...
uk: Завантаження моделі виявлення звуку...

source: More Detections
uk: Більше виявлень

source: Higher Accuracy
uk: Вища точність

source: Background Noise
uk: Фоновий шум

source: FPV Drone
uk: FPV дрон

source: Drone Detection Warning
uk: Попередження про виявлення дрона

# droneDetectedWarningMessage
source: A drone has been detected in the area! Please take appropriate safety measures.
uk: В районі виявлено дрон! Будь ласка, вживіть відповідних заходів безпеки.

source: Close
uk: Закрити
